In [2]:
import numpy as np
import pandas as pd

In [5]:
test_df=pd.read_csv('test1.csv',sep=';')

In [6]:
print(test_df)

     ,C1,C2,C3,C4
0      R1,0,1,2,3
1      R2,4,5,6,7
2    R3,8,9,10,11
3  R4,12,13,14,15
4  R5,16,17,18,19

In [9]:
from io import StringIO,BytesIO

In [10]:
data=('c1,c2,c3\n'
     'x,y,1\n'
     'a,b,2\n'
     'c,d,3')

In [11]:
data

'c1,c2,c3\nx,y,1\na,b,2\nc,d,3'

In [12]:
StringIO()

In [13]:
pd.read_csv(StringIO(data))

  c1 c2  c3
0  x  y   1
1  a  b   2
2  c  d   3

In [19]:
df=pd.read_csv(StringIO(data),usecols=['c1','c3'])

In [20]:
df

  c1  c3
0  x   1
1  a   2
2  c   3

In [21]:
df.to_csv('Test.csv')

In [22]:
print(data)

c1,c2,c3
x,y,1
a,b,2
c,d,3

In [25]:
data=('a,b,c,d\n'
     '1,2,3,4\n'
     '5,6,7,8\n'
     '9,10,11,12')

In [27]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [28]:
df=pd.read_csv(StringIO(data),dtype=object)

In [29]:
df

   a   b   c  d
0  1   2   3  4
1  5   6   7  8
2  9  10  11  12

In [30]:
df=pd.read_csv(StringIO(data),dtype={'b':int,'c':float,})

In [31]:
df

   a   b     c  d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [32]:
df.dtypes

a       int64
b       int32
c     float64
d       int64
dtype: object

In [33]:
data=('index,a,b,c\n'
     '4,apple,bat,5.7\n'
     '8,orange,cow,10')

In [34]:
pd.read_csv(StringIO(data),index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [37]:
data=('a,b,c\n'
     '4,apple,bat,\n'
     '8,orange,cow,')

In [38]:
pd.read_csv(StringIO(data))

        a    b   c
4   apple  bat NaN
8  orange  cow NaN

In [39]:
pd.read_csv(StringIO(data),index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [46]:
pd.read_csv(StringIO(data),usecols=['a','c'],index_col=0)

        a   c
4   apple NaN
8  orange NaN

In [47]:
data='a,b\n"hello,\\"Bob\\",nice to see you",5'

In [48]:
pd.read_csv(StringIO(data),escapechar='\\')

                             a  b
0  hello,"Bob",nice to see you  5

In [51]:
df=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',sep='\t')

In [52]:
df

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,399
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,374
4,SA0L1,All items less food,1,T,358
...,...,...,...,...,...
394,SS68023,Tax return preparation and other accounting fees,4,T,352
395,SSEA011,College textbooks,3,T,314
396,SSFV031A,Food at elementary and secondary schools,3,T,122
397,SSGE013,Infants' equipment,3,T,355
398,SSHJ031,Infants' furniture,3,T,165

In [53]:
df.head()

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,399
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,374
4,SA0L1,All items less food,1,T,358

In [54]:
df.describe()

       display_level  sort_sequence
count     399.000000     399.000000
mean        3.192982     200.000000
std         1.817102     115.325626
min         0.000000       1.000000
25%         2.000000     100.500000
50%         3.000000     200.000000
75%         4.000000     299.500000
max         8.000000     399.000000

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 399 entries, 0 to 398
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   item_code      399 non-null    object
 1   item_name      399 non-null    object
 2   display_level  399 non-null    int64
 3   selectable     399 non-null    object
 4   sort_sequence  399 non-null    int64
dtypes: int64(2), object(3)
memory usage: 11.0+ KB